In [61]:
import pandas as pd
from sqlalchemy import create_engine

In [62]:
# pip install psycopg2-binary

In [63]:
connection_str = 'postgresql://postgres:postgres@192.168.24.206:15432/postgres'
conn = create_engine(connection_str)

query = '''
SELECT * 
FROM myapp_payment
'''

In [64]:
query = '''
    SELECT * 
    FROM myapp_item
'''
df_item = pd.read_sql(query, con=conn)
df_item

   id   title unit  unit_price                                 description
0   1   apple  ลูก        17.0           apple จากสระบุรี หวานอร่อย หอมมัน
1   2  banana  ลูก         9.0  banana จากอยุธยา คัดสรรอย่างดีจากไร่มีชื่อ
2   3  ลองกอง  ลูก         4.0                                        None
3   4  มังคุด  ลูก         0.0                                        None

In [65]:
# df_item.to_csv('tutorial_data/original_item.csv', index=False)

In [66]:
query = '''
    SELECT * 
    FROM myapp_orderitem
'''
df_orderitem = pd.read_sql(query, con=conn)
df_orderitem

   id   quantity  item_id  order_id
0   1          2        1         1
1   2          3        2         1
2   3          5        1         2
3   4          5        2         3
4   5         10        2         4
5   6          0        1         4
6   7  100000000        1         4
7   8          4        4         4

In [67]:
# df_orderitem.to_csv('tutorial_data/original_orderitem.csv', index=False)

In [68]:
query = '''
    SELECT * 
    FROM myapp_payment
'''
df_payment = pd.read_sql(query, con=connection_str)
df_payment

   id                   created  amount  order_id
0   1 2022-06-01 19:29:16+00:00    50.0         1
1   2 2022-06-02 19:49:43+00:00    11.0         1
2   3 2022-06-09 19:55:12+00:00    84.0         2
3   4 2022-06-03 19:55:58+00:00    45.0         3
4   5 2022-06-03 19:56:22+00:00    90.0         4
5   6 2022-06-03 19:56:22+00:00     0.0         4

In [69]:
# df_payment.to_csv('tutorial_data/original_payment.csv', index=False)

### add abnormal record in df_orderitem

In [70]:
df_item = pd.read_csv('tutorial_data/original_item.csv')

In [71]:
df_item.loc[0, 'description'] = 'apple จากสระบุรี หวานอร่อย หอมมัน'
df_item.loc[1, 'description'] = 'banana จากอยุธยา คัดสรรอย่างดีจากไร่มีชื่อ'

In [72]:
df_abnormal_item = pd.DataFrame([
    {
        'id': 3,
        'title': "ลองกอง",
        'unit': "ลูก",
        'unit_price': 4,
        "description": None
    },
    {
        'id': 4,
        'title': "มังคุด",
        'unit': "ลูก",
        'unit_price': 0,
        "description": None
    }
])
df_new_item = pd.concat([df_item, df_abnormal_item])
df_new_item

   id   title unit  unit_price                                 description
0   1   apple  ลูก        17.0           apple จากสระบุรี หวานอร่อย หอมมัน
1   2  banana  ลูก         9.0  banana จากอยุธยา คัดสรรอย่างดีจากไร่มีชื่อ
0   3  ลองกอง  ลูก         4.0                                        None
1   4  มังคุด  ลูก         0.0                                        None

In [73]:
df_orderitem = pd.read_csv('tutorial_data/original_orderitem.csv')

In [74]:
df_abnormal_orderitem = pd.DataFrame([
    {
        'id': 6,
        'quantity': 0,
        'item_id': 1,
        'order_id': 4,
    },
    {
        'id': 7,
        'quantity': 100000000,
        'item_id': 1,
        'order_id': 4,
    },
    {
        'id': 8,
        'quantity': 4,
        'item_id': 4,
        'order_id': 4,
    }
])
df_new_orderitem = pd.concat([df_orderitem, df_abnormal_orderitem])
df_new_orderitem

   id   quantity  item_id  order_id
0   1          2        1         1
1   2          3        2         1
2   3          5        1         2
3   4          5        2         3
4   5         10        2         4
0   6          0        1         4
1   7  100000000        1         4
2   8          4        4         4

In [75]:
df_payment = pd.read_csv('tutorial_data/original_payment.csv')

In [76]:
df_abnormal_payment = pd.DataFrame([
    {
        'id': 6,
        'created': df_payment.iloc[-1].created,
        'amount': 0,
        'order_id': 4,
    }    
])
df_new_payment = pd.concat([df_payment, df_abnormal_payment])
df_new_payment

   id                    created  amount  order_id
0   1  2022-06-01 19:29:16+00:00    50.0         1
1   2  2022-06-02 19:49:43+00:00    11.0         1
2   3  2022-06-09 19:55:12+00:00    84.0         2
3   4  2022-06-03 19:55:58+00:00    45.0         3
4   5  2022-06-03 19:56:22+00:00    90.0         4
0   6  2022-06-03 19:56:22+00:00     0.0         4

In [77]:
conn.execute(f'TRUNCATE myapp_orderitem, myapp_payment, myapp_item')

In [78]:
df_new_item.to_sql('myapp_item', con=conn, if_exists='append', index=False)

4

In [79]:
df_new_orderitem.to_sql('myapp_orderitem', con=conn, if_exists='append', index=False)

8

In [80]:
df_new_payment.to_sql('myapp_payment', con=conn, if_exists='append', index=False)

6

### Read New Data

In [100]:
query = '''
    SELECT * 
    FROM myapp_item
'''
df = pd.read_sql(query, con=conn)

In [21]:
query = '''
    SELECT * 
    FROM myapp_orderitem
'''
pd.read_sql(query, con=conn)

   id   quantity  item_id  order_id
0   1          2        1         1
1   2          3        2         1
2   3          5        1         2
3   4          5        2         3
4   5         10        2         4
5   6          0        1         4
6   7  100000000        1         4
7   8          4        4         4

In [22]:
query = '''
    SELECT * 
    FROM myapp_payment
'''
pd.read_sql(query, con=conn)

   id                   created  amount  order_id
0   1 2022-06-01 19:29:16+00:00    50.0         1
1   2 2022-06-02 19:49:43+00:00    11.0         1
2   3 2022-06-09 19:55:12+00:00    84.0         2
3   4 2022-06-03 19:55:58+00:00    45.0         3
4   5 2022-06-03 19:56:22+00:00    90.0         4
5   6 2022-06-03 19:56:22+00:00     0.0         4